#+TITLE: Crypto CTF Challenges
#+AUTHOR: Black1fsh



**** scratch:
#+begin_src python :session a2s :results output raw
  from Crypto.Cipher import AES
  from Crypto.Util.Padding import pad, unpad
  import hashlib
  from uuid import uuid4

  p = []
  c = []
  plaintext = uuid4().bytes
  d0 = plaintext #bytearray([0] * 16)
  d1 = bytearray([0] * 16)
  d1[0] = 0x01
  d2 = bytearray([0] * 16)
  d2[0] = 0x02
  dc = bytearray([0] * 16)
  dc[0] = 0x0c

  key = [0x41] * 16
  key = bytearray(key);
  cipher = A2S(key)
  key_expand = cipher._key_matrices
  delta_ins = [d1,d2,dc]
  delta_outs = []
  logs = []
  for di in delta_ins:
      ll = []
      plaintext = [x ^ y for x , y in zip(di,d0)]
      plain_state = bytes2matrix(plaintext)
      ll.append(matrix2bytes(plain_state).hex())
      add_round_key(plain_state, key_expand[0])
      ll.append(matrix2bytes(plain_state).hex())
      for i in range(1, cipher.n_rounds):
          shift_rows(plain_state) # p4: moved shift_rows here to capture the expected state for testing
          ll.append(matrix2bytes(plain_state).hex())
          sub_bytes(plain_state)
          ll.append(matrix2bytes(plain_state).hex())
          #mix_columns(plain_state)
          ll.append(matrix2bytes(plain_state).hex())
          add_round_key(plain_state,key_expand[i])
          ll.append(matrix2bytes(plain_state).hex())

      sub_bytes(plain_state)
      ll.append(matrix2bytes(plain_state).hex())
      shift_rows(plain_state)
      ll.append(matrix2bytes(plain_state).hex())
      #mix_columns(plain_state)  # added mix_columns
      ll.append(matrix2bytes(plain_state).hex())
      add_round_key(plain_state, key_expand[-1])
      ll.append(matrix2bytes(plain_state).hex())
      logs.append(ll)


  for l in logs[1:]:
      print("|plain |add keys |shift | sbox| mix| add keys  | sbox  | shift | mix  | add keys |")
      print('|' + '|'.join([i for i in logs[0]]) + '|')
      print('|' + '|'.join([i for i in l]) + '| | |')
      print()

  def ishift(b):
      s = bytearray.fromhex(b)
      s = bytes2matrix(s)
      inv_shift_rows(s)
      s = matrix2bytes(s)
      s = s.hex()
      return s
  def imix(b):
      s = bytearray.fromhex(b)
      s = bytes2matrix(s)
      inv_mix_columns(s)
      s = matrix2bytes(s)
      s = s.hex()
      return s
  def ixor(b):
      x = b.split(" | ")
      a0 = bytearray.fromhex(x[0])
      a1 = bytearray.fromhex(x[1])
      s = bytearray([i ^ k for i,k in zip(a0,a1)])
      s = s.hex()
      return s

#+end_src

#+RESULTS:
| plain    | 241d2cc711104f05beb283c82c7e0d8c | 271d2cc711104f05beb283c82c7e0d8c |  3000000000000000000000000000000 |   |
| add keys | 655c6d8650510e44fff3c2896d3f4ccd | 665c6d8650510e44fff3c2896d3f4ccd |  3000000000000000000000000000000 |   |
| shift    | 6551c2cd50f34c86ff3f6d446d5c0e89 | 6651c2cd50f34c86ff3f6d446d5c0e89 |  3000000000000000000000000000000 |   |
| sbox     | 4dd125bd530d294416753c1b3c4aaba7 | 33d125bd530d294416753c1b3c4aaba7 | 7e000000000000000000000000000000 |   |
| mix      | 4dd125bd530d294416753c1b3c4aaba7 | 33d125bd530d294416753c1b3c4aaba7 | 7e000000000000000000000000000000 |   |
| add keys | 8e13e77fd18eaac7d5b7fed9bec92824 | f013e77fd18eaac7d5b7fed9bec92824 | 7e000000000000000000000000000000 |   |
| sbox     | 197d94d23e19acc603a9bb35aedd3436 | 8c7d94d23e19acc603a9bb35aedd3436 | 95000000000000000000000000000000 |   |
| shift    | 1919bb363ea934d203dd94c6ae7dac35 | 8c19bb363ea934d203dd94c6ae7dac35 | 95000000000000000000000000000000 |   |
| mix      | 1919bb363ea934d203dd94c6ae7dac35 | 8c19bb363ea934d203dd94c6ae7dac35 | 95000000000000000000000000000000 |   |
| add keys | 343795e7910499806fb2fb5640914026 | a13795e7910499806fb2fb5640914026 | 95000000000000000000000000000000 |   |
|          |                                  |                                  |                                0 |   |
|          |                                  |                                  |                                0 |   |
#+TBLFM: $4='(hex-xor $3 $2)

|plain |add keys |shift | sbox| mix| add keys  | sbox  | shift | mix  | add keys |
|241d2cc711104f05beb283c82c7e0d8c|655c6d8650510e44fff3c2896d3f4ccd|6551c2cd50f34c86ff3f6d446d5c0e89|4dd125bd530d294416753c1b3c4aaba7|4dd125bd530d294416753c1b3c4aaba7|8e13e77fd18eaac7d5b7fed9bec92824|197d94d23e19acc603a9bb35aedd3436|1919bb363ea934d203dd94c6ae7dac35|1919bb363ea934d203dd94c6ae7dac35|343795e7910499806fb2fb5640914026|
|291d2cc711104f05beb283c82c7e0d8c|685c6d8650510e44fff3c2896d3f4ccd|6851c2cd50f34c86ff3f6d446d5c0e89|45d125bd530d294416753c1b3c4aaba7|45d125bd530d294416753c1b3c4aaba7|8613e77fd18eaac7d5b7fed9bec92824|447d94d23e19acc603a9bb35aedd3436|4419bb363ea934d203dd94c6ae7dac35|4419bb363ea934d203dd94c6ae7dac35|693795e7910499806fb2fb5640914026| | |

#+begin_src python :session a2s
  x = [a, b, c, d]

#+end_src

#+RESULTS:
: None

P(delta_x) ?= delta_y0 delta_y1 delta_y2 .......
1/2^128
key = '41414141414141414141414141414141'
|   | plain    | 7d95d7d9ba564e419cada946087df33b | 7e95d7d9ba564e419cada946087df33b | 03000000000000000000000000000000 | xor'ed | 03000000000000000000000000000000 | NO     |
|   | add keys | 3cd49698fb170f00ddece807493cb27a | 3fd49698fb170f00ddece807493cb27a | 03000000000000000000000000000000 | xored  | 03000000000000000000000000000000 | NO     |
|   | shift    | 3c17e87afbecb298dd3c960049d40f07 | 3f17e87afbecb298dd3c960049d40f07 | 03000000000000000000000000000000 | xor'ed | 03000000000000000000000000000000 | shift  |
|!  | sbox     | ebf09bda0fce3746c1eb90633b4876c5 | 75f09bda0fce3746c1eb90633b4876c5 | 9e000000000000000000000000000000 | xor'ed | 9e000000000000000000000000000000 |  1/2^16 |
|!  | mix      | 877c43e2269765644cc4b4e51df4cbe2 | a0e2dd5b269765644cc4b4e51df4cbe2 | 279e9eb9000000000000000000000000 | xor'ed | 279e9eb9000000000000000000000000 |        |
|!  | add keys | 44be8120a414e6e78f0676279f774861 | 63201f99a414e6e78f0676279f774861 | 279e9eb9000000000000000000000000 | xor'ed | 279e9eb9000000000000000000000000 |        |
|!  | sbox     | 1bae0cb749fa8e94736f38ccdbf552ef | fbb7c0ee49fa8e94736f38ccdbf552ef | e019cc59000000000000000000000000 | xor'ed | e019cc59000000000000000000000000 |  1/2^16 |
|   | shift    | 1bfa38ef496f52b773f50c94dbae8ecc | fbfa38ef496f52ee73f5c094dbb78ecc | e0000000000000590000cc0000190000 | xor'ed | e019cc59000000000000000000000000 | ishift |
|   | mix      | f453bb2ac6d640937a02395f06d93dd5 | 2fb35b119f8fab21b64dba932deb24cc | dbe0e03b5959ebb2cc4f83cc2b321919 | xor'ed | e0000000000000590000cc0000190000 | imix   |
|   | add keys | d97d95fb697bedc1166d56cfe835d1c6 | 029d75c030220673da22d503c307c8df | dbe0e03b5959ebb2cc4f83cc2b321919 | xor'ed | dbe0e03b5959ebb2cc4f83cc2b321919 |        |
|   |          |                                  |                                  |                                  |        |                                  |        |
|   |          |                                  |                                  |                                  |        |                                  |        |

| *        |                                * |                                * |                          xor'ed |                                  |                   |
| plain    | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| add keys | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| shift    | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| sbox     | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| mix      | 00000000000000000000000000000000 | 02010103000000000000000000000000 | 2010103000000000000000000000000 |                                  |                   |
| add keys | 62636363626363636263636362636363 | 60626260626363636263636362636363 | 2010103000000000000000000000000 |                                 |                   |
| sbox     | 62636363626363636263636362636363 | 60626260626363636263636362636363 | 2010103000000000000000000000000 |                                  |                   |
| shift    | 62636363626363636263636362636363 | 60636363626363606263626362626363 | 2000000000000030000010000010000 | 02010103000000000000000000000000 | inverse shift     |
| mix      | 61626260616262606162626061626260 | 65606066626167666061606162606361 | 4020206030305060103020103020101 | 02000000000000030000010000010000 | invese mixcolumns |
| add keys | fafafaa9989999cafafafaa9989999ca | fef8f8af9b9a9cccfbf9f8a89b9b98cb | 4020206030305060103020103020101 |  4020206030305060103020103020101 | xor'ed            |
#+TBLFM: $4='(hex-xor $3 $2)

| plain    | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| add keys | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| shift    | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| sbox     | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| mix      | 00000000000000000000000000000000 | 04020206000000000000000000000000 | 4020206000000000000000000000000 |
| add keys | 62636363626363636263636362636363 | 66616165626363636263636362636363 | 4020206000000000000000000000000 |
| sbox     | 62636363626363636263636362636363 | 66616165626363636263636362636363 | 4020206000000000000000000000000 |
| shift    | 62636363626363636263636362636363 | 66636363626363656263616362616363 | 4000000000000060000020000020000 |
| mix      | 61626260616262606162626061626260 | 6966666c6764686c6364666267666062 | 804040c06060a0c0206040206040202 |
| add keys | fafafaa9989999cafafafaa9989999ca | f2fefea59e9f93c6f8fcfeab9e9d9bc8 | 804040c06060a0c0206040206040202 |
#+TBLFM: $4='(hex-xor $3 $2)
| plain    | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| add keys | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| shift    | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| sbox     | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| mix      | 00000000000000000000000000000000 | 180c0c14000000000000000000000000 | 180c0c14000000000000000000000000 |
| add keys | 62636363626363636263636362636363 | 7a6f6f77626363636263636362636363 | 180c0c14000000000000000000000000 |
| sbox     | 62636363626363636263636362636363 | 7a6f6f77626363636263636362636363 | 180c0c14000000000000000000000000 |
| shift    | 62636363626363636263636362636363 | 7a6363636263637762636f63626f6363 | 180000000000001400000c00000c0000 |
| mix      | 61626260616262606162626061626260 | 517a7a4875765e486d767a6c757a6e6c | 3018182814143c280c14180c14180c0c |
| add keys | fafafaa9989999cafafafaa9989999ca | cae2e2818c8da5e2f6eee2a58c8195c6 | 3018182814143c280c14180c14180c0c |
#+TBLFM: $4='(hex-xor $3 $2)

#+begin_src python :session a2s
def print_ddt(ddt, max_rows=30, max_cols=30):
      """Print the DDT in a formatted way, limited to specified dimensions."""
      print("\nDifferential Distribution Table (partial):")
      print("   |", end=" ")

      # Print header
      for j in range(max_cols):
          print(f"{j:2X}", end=" ")
      print("\n---+" + "---" * max_cols)

      # Print rows
      for i in range(max_rows):
          print(f"{i:2X} |", end=" ")
          for j in range(max_cols):
              print(f"{ddt[i][j]}", end=" ")
          print()

#+end_src
#+begin_src python :session a2s
  p0 = 0x41
  res = {}
  size = len(s_box)
  ddt = [[[0,[]] for _ in range(size)] for _ in range(size)]
  for delta_in in range(size):
        for x in range(size):
            y1 = s_box[x]
            y2 = s_box[x ^ delta_in]
            delta_out = y1 ^ y2
            ddt[delta_in][delta_out][0] += 1
            ddt[delta_in][delta_out][1] += [hex(x)]
  #flatten = [i for k in ddt for i in k]
  print(ddt[0x3][0x9e])
  p0 = 0x41
  res = {}
  size = len(s_box)
  ddti = [[[0,[]] for _ in range(size)] for _ in range(size)]
  for delta_in in range(size):
        for x in range(size):
            y1 = inv_s_box[x]
            y2 = inv_s_box[x ^ delta_in]
            delta_out = y1 ^ y2
            ddti[delta_in][delta_out][0] += 1
            ddti[delta_in][delta_out][1] += [hex(x)]
  #flatten = [i for k in ddt for i in k]
  print(ddt[0x3][0x9e])
#+end_src

#+RESULTS:
: None

#+begin_src emacs-lisp :tangle yes
 (defun hex-xor (a b)
     (interactive
      (list
       (read-string "first hex string: ")
       (read-string "second hex string: ")))
     (message "A= %s B= %s" a b)
     (let*
         ((num_a (string-to-number (format "%s" a) 16))
          (num_b (string-to-number (format "%s" b) 16))
          (result (format "%x" (logxor num_a num_b))))
          (message "a_int = %s b_int = %s result = %s" num_a num_b result)

  result)
 )
#+end_src

